INSERT INTO RESTAURANT (name_restaurant)
VALUES ('кафе Central Perk '),
       ('Dr. Живаго'),
       ('White Rabbit');

INSERT INTO USERS (name, password, restaurant_id)
VALUES ( 'Росс Гейлер', 'друзья', 1 ),
       ( 'Моника Гейлер', 'друзья', 1 ),
       ( 'Джо Трибиани', 'друзья', 1 ),
       ( 'Чендлер Бинг', 'друзья', 1 ),
       ( 'Рейчел Грин', 'друзья', 1 ),
       ( 'Фиби Буфэ', 'друзья', 1 ),
       ( 'Давид', 'qwerty', 2 ),
       ( 'Иван', 'qwerty', 3 );

-- INSERT INTO USER_ROLE (ROLE, USER_ID)
-- VALUES ('USER', 1),
--        ('ADMIN', 2);

INSERT INTO MEAL (DISH, PRICE, RESTAURANT_ID)
VALUES ( 'кофе', '2.2', 1 ),
       ( 'чай', '1.3', 1 ),
       ( 'пирожное', '3', 1 ),
       ( 'пицца', '8.5', 1 ),
       ( 'тортик', '2.5', 1 ),
       ( 'борщ', '2.9', 2 ),
       ( 'суп гороховый', '1.9', 2 ),
       ( 'кофе', '1.0', 2 ),
       ( 'чай', '0.5', 2 ),
       ( 'шаурма', '0.3', 2 ),
       ( 'Шоколадный ролл', '2.2', 3 ),
       ( 'Фруктовый ролл', '3.2', 3 ),
       ( 'Овощной ролл', '2.5', 3 ),
       ( 'Изуми ролл', '2.3', 3 ),
       ( 'Тропический ролл', '2.0', 3 );
